Rails/Project/cms/app/views/subjects/show.html.erb

    <tr>
      <td>Pages</td><td> : </td><td class='center'><%= @subject.pages.size %></td>
---
SELECT COUNT(*) FROM "pages" WHERE "pages"."subject_id" = $1  [["subject_id", 1]]