Rails/Project/cms/app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" ORDER BY position ASC
---
  def index
    @pages = Page.order('position ASC')

INSERT INTO "pages" ("subject_id", "name", "position", "visible", "permalink", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    # Instantiate a new object using form parameters
    @page = Page.new(page_params)

    # Save the object
    if @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pages" SET "permalink" = $1, "updated_at" = $2 WHERE "pages"."id" = $3  [["permalink", "abcdef.com"], ["updated_at", "2024-04-25 12:52:01.691055"], ["id", 1]]
---
  def update
    @page = Page.find(params[:id])

    if @page.update(page_params)

SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def delete
    @page = Page.find(params[:id])

SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "pages" WHERE "pages"."id" = $1  [["id", 3]]
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy