Rails/Project/cms/app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.order('position ASC')
---
SELECT "subjects".* FROM "subjects" ORDER BY position ASC

  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)

    # Save the object
    if @subject.save
---
INSERT INTO "subjects" ("name", "position", "visible", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", nil], ["position", nil], ["visible", nil], ["created_at", "2024-04-23 13:33:34.438583"], ["updated_at", "2024-04-23 13:33:34.438583"]]

  def edit
    @subject=Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update
    @subject=Subject.find(params[:id])
    if @subject.update(subject_params)
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "subjects" SET "visible" = $1, "updated_at" = $2 WHERE "subjects"."id" = $3  [["visible", true], ["updated_at", "2024-04-25 11:44:21.236988"], ["id", 7]]

  def delete
    @subject=Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def destroy
    @subject=Subject.find(params[:id])
    @subject.destroy
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "subjects" WHERE "subjects"."id" = $1  [["id", 1]]